[{"id":1,"name":"Roronoa Zoro \"Nothing Happened\" Anime Hoodie","price":199.99,"image":"assets/zoro_front.png","imageHover":"assets/zoro_back.png","category":"Anime","description":"Represent one of the most legendary moments in anime history with this Roronoa Zoro hoodie. Features Zoro's iconic intense eyes with Japanese text \"ロロノア\" on the front. The back showcases the unforgettable \"Nothing Happened\" scene with Zoro standing bloodied but unbroken, complete with bold \"NOTHING\" text and Japanese phrase \"何も起こらなかった\" (Nothing Happened). Made from comfortable cotton blend fabric. A must-have for true One Piece fans who understand loyalty, sacrifice, and the warrior's code. This design captures the essence of Zoro's unshakeable spirit.","colors":[{"name":"Black","hex":"#000000"},{"name":"Green","hex":"#059669"}]},{"id":2,"name":"Monkey D. Luffy \"Gear 5\" Wanted Hoodie","price":199.99,"image":"assets/luffy_front.png","imageHover":"assets/luffy_back.png","category":"Anime","description":"Unleash the drums of liberation with this exclusive Gear 5 Luffy hoodie. The front features a stylized, dynamic graphic, while the back displays the iconic \"WANTED\" poster of Monkey D. Luffy in his awakened Sun God Nika form. With a bounty of 3,000,000,000 berries, this design screams freedom and power. Crafted for ultimate comfort and style, perfect for those who dream of becoming the Pirate King.","colors":[{"name":"White","hex":"#FFFFFF"},{"name":"Red","hex":"#DC2626"}]},{"id":3,"name":"Itachi Uchiha \"Akatsuki\" Nike Hoodie","price":200,"image":"assets/itachi_front.png","imageHover":"assets/itachi_back.png","category":"Anime","description":"Embrace the shadow of the Leaf with this Itachi Uchiha masterpiece. The front features a unique crossover design with Itachi performing a jutsu. The back displays a stunning, detailed artwork of Itachi in his Akatsuki cloak surrounded by crows, capturing his tragic yet powerful legacy. High-quality print on premium cotton. Perfect for those who walk the path of solitude.","colors":[{"name":"Black","hex":"#000000"},{"name":"Red","hex":"#DC2626"}]}]